Revit 2027 API
ControlledApplication.OpenSharedParameterFile Method
Enables access to shared parameter groups and definitions that are maintained on disk.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DefinitionFile OpenSharedParameterFile()
Public Function OpenSharedParameterFile As DefinitionFile
public:
DefinitionFile^ OpenSharedParameterFile()
member OpenSharedParameterFile : unit -> DefinitionFile
Return Value
DefinitionFile
An object that represents a shared parameters file that exists on disk. Returns null if the file does not exist.
Remarks
This function is used to return an object that represents a Revit shared parameters file Revit can use only one shared parameters file at one time. The filename for the shared parameters file can be set in the Application.SharedParametersFilename property.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace